leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioF_state = gpioF_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
    else if ( changedPinG != 0 )
    {
        int bitPosition = 0;
        while ( changedPinG )
        {
        	changedPinG >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 96; // 핀 번호 (포트 E는 64 ~ 79)
        result.pinState = (gpioG_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioG_state = gpioG_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;

    }
    else if ( changedPinH != 0 )
    {
        int bitPosition = 0;
        while ( changedPinH )
        {
        	changedPinH >>= 1;
            bitPosition++;
        }

        result.pinNumber = bitPosition + 112; // 핀 번호 (포트 E는 64 ~ 79)
        result.pinState = (gpioH_state >> bitPosition) & 1;

        if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
        {
        	Last_gpioH_state = gpioH_state;
        	DebounceTimer[result.pinNumber] = CurrentTime;
        }
        else
        {
            result.pinNumber = -1; // 초기값 (-1: 변경 없음)
            result.pinState = -1;
        }
        return result;
    }
	else if ( changedPinI != 0 )
	{
		int bitPosition = 0;
		while ( changedPinI )
		{
			changedPinI >>= 1;
			bitPosition++;
		}

		result.pinNumber = bitPosition + 128; // 핀 번호 (포트 E는 64 ~ 79)
		result.pinState = (gpioI_state >> bitPosition) & 1;

		if ( CurrentTime - DebounceTimer[result.pinNumber] > DEBOUNCE_TIME )
		{
			Last_gpioI_state = gpioI_state;
			DebounceTimer[result.pinNumber] = CurrentTime;
		}
		else
		{
			result.pinNumber = -1; // 초기값 (-1: 변경 없음)
			result.pinState = -1;
		}
		return result;
        

        char message[100];
        sprintf(message, "E | pinNumber = %d | pinState = %d \n\r", result.pinNumber, result.pinState);
        HAL_UART_Transmit(&huart4, (uint8_t *)message, strlen(message), HAL_MAX_DELAY);

    }

    return result;
}



void KeyboardInit(void) {
    for(int i=0; i<KEY_NUMBER; ++i) {
        FromWhichLayer[i] = -1;
    }
    CurrentTapDance.dance_index = -1;
    CurrentTapDance.pressed = false;
    CurrentTapDance.count = 0;
    CurrentTapDance.activated = false;
    CurrentTapDance.last_pressed = 0;
    return;
}



void SetKeycode(int keycode)
{   
    if (keycode == keyboardReport.Keycode1 || keycode == keyboardReport.Keycode2 || keycode == keyboardReport.Keycode3 || keycode == keyboardReport.Keycode4 || keycode == keyboardReport.Keycode5 || keycode == keyboardReport.Keycode6)
    {
        return;
    }
    else if (keyboardReport.Keycode1 == 0x00)
    {
        keyboardReport.Keycode1 = keycode;
    }
    else if (keyboardReport.Keycode2 == 0x00)
    {
        keyboardReport.Keycode2 = keycode;
    }
    else if (keyboardReport.Keycode3 == 0x00)
    {
        keyboardReport.Keycode3 = keycode;
    }
    else if (keyboardReport.Keycode4 == 0x00)
    {
        keyboardReport.Keycode4 = keycode;
    }
    else if (keyboardReport.Keycode5 == 0x00)
    {
        keyboardReport.Keycode5 = keycode;
    }
    else if (keyboardReport.Keycode6 == 0x00)
    {
        keyboardReport.Keycode6 = keycode;
    }
    return;
}

void ResetKeycode(int keycode)
{
    if (keyboardReport.Keycode1 == keycode)
    {
        keyboardReport.Keycode1 = 0x00;
    }
    if (keyboardReport.Keycode2 == keycode)
    {
        keyboardReport.Keycode2 = 0x00;
    }
    if (keyboardReport.Keycode3 == keycode)
    {
        keyboardReport.Keycode3 = 0x00;
    }
    if (keyboardReport.Keycode4 == keycode)
    {
        keyboardReport.Keycode4 = 0x00;
    }
    if (keyboardReport.Keycode5 == keycode)
    {
        keyboardReport.Keycode5 = 0x00;
    }
    if (keyboardReport.Keycode6 == keycode)
    {
        keyboardReport.Keycode6 = 0x00;
    }
}

void KeycodeSend()
{
    USBD_HID_SendReport(&hUsbDeviceHS, (uint8_t *)&keyboardReport, sizeof(keyboardReport));

    char message[100];
    sprintf(message, "KeycodeSend \n\r");
    HAL_UART_Transmit(&huart4, (uint8_t *)message, strlen(message), HAL_MAX_DELAY);
}

int GetLayer(int SwitchIndex) 
{   
    uint8_t now = 31;
    while (now!=0)
    {
        if( (LayerState&(1<<now)) && (Keycode[now][SwitchIndex]!=KC_TRNS))
        {
            break;
        }
        --now;
    }
    LayerState|=1; //레이어0이 혹시나 꺼졌을 경우 레이어 확인때 자동으로 켜지게
    return now;
}


void TapDance(int tdindex, bool pressed)
{
    if (pressed) {
        if (CurrentTapDance.dance_index == -1) {
            CurrentTapDance.dance_index = tdindex;
            CurrentTapDance.pressed = pressed;
            CurrentTapDance.count = 1;
            CurrentTapDance.activated = false;
            CurrentTapDance.last_pressed = CurrentTime;
            return;
        }

        CurrentTapDance.pressed = pressed;
        CurrentTapDance.count++;
        CurrentTapDance.activated = false;
        CurrentTapDance.last_pressed = CurrentTime;
        return;

    }else {
        if (CurrentTapDance.last_pressed>=TAPPING_TERM) {
            switch(CurrentTapDance.dance_index) {
                case 1: {
                    ReleaseKeycode(KC_B);
                    break;
                }
                default: {
                    break;
                }
            }
            CurrentTapDance.dance_index = -1;
            CurrentTapDance.activated = false;
            CurrentTapDance.count = 0;
            CurrentTapDance.pressed = false;
        }
        CurrentTapDance.pressed = pressed;
        return;
    }
    return;
}

void TapDanceTask(void) {
    if (CurrentTapDance.dance_index == -1) {
        return;
    }

