leeseunghun057/STM32with8000Hz/STM32H743/Core/Src/main.c
    if (CurrentTime-CurrentTapDance.last_pressed>TAPPING_TERM) {
        CurrentTapDance.activated = true;
    }

    if (CurrentTapDance.activated) {
        // do tap dance things
        switch(CurrentTapDance.dance_index) {
            case 1: {
                if (CurrentTapDance.pressed && CurrentTime-CurrentTapDance.last_pressed>TAPPING_TERM) {
                    PressKeycode(KC_B);
                }else {
                    PressKeycode(KC_A);
                    KeycodeSend();
                    HAL_DELAY(TAP_DELAY);
                    ReleaseKeycode(KC_A);
                    KeycodeSend();
                }
                break;
            }
            default: {
                break;
            }
        }
        CurrentTapDance.dance_index = -1;
        CurrentTapDance.activated = false;
        CurrentTapDance.count = 0;
        CurrentTapDance.pressed = false;
    }
    return;
}

void PressSwitch(int SwitchIndex) {
    int Layer = GetLayer(SwitchIndex);
    FromWhichLayer[SwitchIndex] = Layer;
    PressKeycode(Keycode[Layer][SwitchIndex]);
    return;
}

void PressKeycode(uint16_t keycode)
{
    if (keycode==0||keycode==1) return;


    // 탭댄스 중에 다른 키 입력이 들어왔을 때 선입력된 탭댄스 발동 후에 키 처리
    if (CurrentTapDance.dance_index!=-1 && ((!IS_TD(keycode))||(CurrentTapDance.dance_index!=TD_TO_INDEX(keycode)))) {
        CurrentTapDance.activated = true;
        TapDanceTask();
    }

	if (IS_MOD(keycode))
	{
		Modifier_Sum = Modifier_Sum | Modifier_Bit[keycode - KC_MOD_MIN];
		keyboardReport.MODIFIER = Modifier_Sum;

		char message1[100];
		sprintf(message1, "ModifierPress = %d \n\r", Modifier_Bit[keycode - KC_MOD_MIN]);
		HAL_UART_Transmit(&huart4, (uint8_t *)message1, strlen(message1), HAL_MAX_DELAY);
	}
	else if (IS_FN(keycode) || IS_TD(keycode))
	{

		if ( IS_FN(keycode) )
		{
            LayerState|=(1<<FN_TO_LAYER_NUMBER(keycode));
		}
		else if ( IS_TD(keycode))
		{
			TapDance(TD_TO_INDEX(keycode), true/*pressed*/);
		}
		

		char message1[100];
		sprintf(message1, "Current Layer = %ld \n\r", LayerState);
		HAL_UART_Transmit(&huart4, (uint8_t *)message1, strlen(message1), HAL_MAX_DELAY);
	}
	else
	{
		SetKeycode(keycode);

		char message4[100];
		sprintf(message4, "PressKeycodes = %d \n\r", keycode);
		HAL_UART_Transmit(&huart4, (uint8_t *)message4, strlen(message4), HAL_MAX_DELAY);
	}

    return;
}


void ReleaseSwitch(int SwitchIndex)
{
    int Layer = FromWhichLayer[SwitchIndex];
    ReleaseKeycode(Keycode[Layer][SwitchIndex]);
    FromWhichLayer[SwitchIndex] = -1;
    return;
}


void ReleaseKeycode(uint16_t keycode)
{
    if (keycode==KC_NO || keycode==KC_TRNS)
    {
        return;
    }
    
    if (IS_MOD(keycode))
    {
        Modifier_Sum = Modifier_Sum & ~(MOD_TO_BIT(keycode));
        keyboardReport.MODIFIER = Modifier_Sum;

        char message2[100];
        sprintf(message2, "ModifierRelease = %d\n\r", keycode);
        HAL_UART_Transmit(&huart4, (uint8_t *)message2, strlen(message2), HAL_MAX_DELAY);
    }
    else if (IS_FN(keycode))
    {
        LayerState &= (~(1<<FN_TO_LAYER_NUMBER(keycode)));
        LayerState |= 1; //레이어0은 항상 on
    }
    else if (IS_TD(keycode))
    {
        TapDance(TD_TO_INDEX(keycode), false/*released*/);
    }
    else
    {

        ResetKeycode(keycode);

        char message5[100];
        sprintf(message5, "ReleaseKeycodes = %d \n\r", keycode);
        HAL_UART_Transmit(&huart4, (uint8_t *)message5, strlen(message5), HAL_MAX_DELAY);
    }

    return;

}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* Configure the peripherals common clocks */
  PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USB_DEVICE_Init();
  MX_UART4_Init();
  /* USER CODE BEGIN 2 */

  KeyboardInit();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
    while (1)
    {

    	CurrentTime = HAL_GetTick();

        if (CurrentTime - LastTimer >= 10000)
        {
            char message[100];
            sprintf(message, "Time(ms) = %ld |  Scanrate(Hz) = %d \n\r", CurrentTime, Scanrate / 10);
            HAL_UART_Transmit(&huart4, (uint8_t *)message, strlen(message), HAL_MAX_DELAY);

            LastTimer = HAL_GetTick();
            Scanrate = 0;
        }

        Scanrate = Scanrate + 1;

        // ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ

        MatrixScanResult Matrix = MatrixScan();

        if ( Matrix.pinNumber != -1 )
        {
			if ( Matrix.pinState == 1)
			{
				PressSwitch(Matrix.pinNumber);
				KeycodeSend();
			}
			else
			{
				ReleaseSwitch(Matrix.pinNumber);
				KeycodeSend();
			}

        }

        TapDanceTask();

//        char message[100];
//        sprintf(message, "Test \n\r");
//        HAL_UART_Transmit(&huart4, (uint8_t *)message, strlen(message), HAL_MAX_DELAY);


        //HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_2);


    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_LDO_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 10;
  RCC_OscInitStruct.PLL.PLLN = 384;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_1;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;

